app/src/main/assets/soap/request_bipro501-getdata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://www.bipro.net/namespace/prozesse/partner" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:nac="http://www.bipro.net/namespace/nachrichten" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:all="http://www.bipro.net/namespace/allgemein" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:prod="http://www.bipro.net/namespace/produktmodell" xmlns:par1="http://www.bipro.net/namespace/partner">
    ${soapHeader}
    <soapenv:Body>
        <par:getData>
            <par:Request>
                <nac:BiPROVersion>${version}</nac:BiPROVersion>
                <nac:ConsumerID>${consumerId}</nac:ConsumerID>
                <par:Partnerauskunft>
                    <par:Partnernummer>${partnernr}</par:Partnernummer>
                    <!--#IFDEF ${vunr}--><par:Unternehmen><all:Nummer>${vunr}</all:Nummer><all:Nummernart>BaFin</all:Nummernart></par:Unternehmen><!--/#IFDEF-->
                </par:Partnerauskunft>
            </par:Request>
        </par:getData>
    </soapenv:Body>
</soapenv:Envelope>